app/views/flights/index.html.erb

SELECT "airports".* FROM "airports"
SELECT "flights".* FROM "flights"
---
           <%# Not sure but, it seems like selected attribute is needed for where to work in the index action%>
        <%= form.collection_select :arrival_airport, Airport.all, :id, :code, prompt: 'Select Airport', include_blank: true, selected: params[:flights][:arrival_airport] %>

SELECT "airports".* FROM "airports"
SELECT "flights".* FROM "flights"
---
        <%= form.label :departure_airport, "Departure Airport: " %>
        <%= form.collection_select :departure_airport, Airport.all, :id, :code, prompt: 'Select Airport', include_blank: true, selected: params[:flights][:departure_airport] %>

SELECT "flights".* FROM "flights"
---
        <%= form.label :passengers, "Passengers: "%>
        <%= form.select :passengers, [1,2,3,4], prompt: 'Select Passengers', include_blank: true, selected: params[:flights][:passengers] %>

SELECT "airports".* FROM "airports"
---
        <%= form.label :arrival_airport, "Arrival Airport: " %>
        <%= form.collection_select :arrival_airport, Airport.all, :id, :code, prompt: 'Select Airport'%>

SELECT "airports".* FROM "airports"
---
       <%= form.label :departure_airport, "Departure Airport: " %>
       <%= form.collection_select :departure_airport, Airport.all, :id, :code, prompt: 'Select Airport' %>