app/views/bookings/show.html.erb

SELECT "passengers".* FROM "passengers" WHERE "passengers"."booking_id" = $1  [["booking_id", 2]]
---
<%= render 'flight_info'%>
<% @booking.passengers.each do |p|%>