app/controllers/bookings_controller.rb

SELECT "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 202], ["LIMIT", 1]]
---
  def new
    if params[:bookings][:tickets].present?
      @booking = Booking.new
      @flight = Flight.find(params[:bookings][:flight_id])

INSERT INTO "bookings" ("created_at", "updated_at", "flight_id", "tickets") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2023-08-11 07:17:30.471853"], ["updated_at", "2023-08-11 07:17:30.471853"], ["flight_id", 103], ["tickets", 3]]
SELECT "passengers".* FROM "passengers" WHERE "passengers"."booking_id" = $1  [["booking_id", 5]]
---
  def create
    @booking = Booking.new(book_params)
    if @booking.save
      @booking.passengers.each do |passenger|

SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def show
    @booking = Booking.find(params[:id])
    @flight = Flight.find(@booking.flight_id)